Revit 2024 API
ReferencePointArrayIterator Class
An iterator to a reference array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class ReferencePointArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class ReferencePointArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class ReferencePointArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ReferencePointArrayIterator
See Also
ReferencePointArrayIterator Members
Autodesk.Revit.DB Namespace